Airframe2DegAoA/0/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-3.49 0 -99.94);

boundaryField
{
    inlet
    {
        type              freestream;
        freestreamValue   $internalField;
    }

    outlet
    {
        type              freestream;
        freestreamValue   $internalField;
    }


    freestream
    {
        type              freestream;
        freestreamValue   $internalField;
    }

    airframe
    {
        type            fixedValue;
	value 		uniform (0 0 0);
    }

    centerplane
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
